Revit 2027 API
IFCParameterTemplate.FindByName Method
 Returns mapping template element by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCParameterTemplate FindByName(
	Document document,
	string name
)
Public Shared Function FindByName (
	document As Document,
	name As String
) As IFCParameterTemplate
public:
static IFCParameterTemplate^ FindByName(
	Document^ document,
	String^ name
)
static member FindByName :
        document : Document *
        name : string -> IFCParameterTemplate
Parameters
document Document
 The document to find the mapping template with the specified name.
name String
 Name of the mapping template to find.
Return Value
IFCParameterTemplate
 The mapping template element, or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace